name: "MyNet"
layer{
  name:"data"
  type:"Input"
  top:"data"
  input_param:{shape: {dim:1 dim:1 dim:284 dim:284}}
}
layer{
  name:"conv1"
  type:"Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 12
    kernel_size: 1
    stride: 1
    pad:0
  }
}
layer {
  name:"ip1"
  type:"InnerProduct"
  bottom: "conv1"
  top: "ip1"
  inner_product_param {
    num_output: 3
  }
}
